Repository: neokapi/neokapi
Catalog: l10n/tm/builtins-nb.tmx
Source language: en
Languages: nb

source: 1-based row number containing column names. 0 means auto-detect.
nb: Radnummer (1-basert) som inneholder kolonnenavn. 0 betyr automatisk gjenkjenning.

source: 1-based row number where data values begin. 0 means auto-detect.
nb: Radnummer (1-basert) der dataverdiene begynner. 0 betyr automatisk gjenkjenning.

source: AI Brand Voice Check
nb: AI-kontroll av merkevarestemme

source: AI Entity Extract
nb: AI-entitetsuttrekk

source: AI Provider
nb: AI-leverandør

source: AI QA Check
nb: AI QA-kontroll

source: AI Review
nb: AI-gjennomgang

source: AI Terminology Extraction
nb: AI-terminologiuttrekk

source: AI Translate
nb: AI-oversettelse

source: AI model name
nb: Navn på AI-modell

source: AI provider
nb: AI-leverandør

source: AI provider id for the llm engine
nb: AI-leverandør-ID for llm-motoren

source: API Key
nb: API-nøkkel

source: API key for the AI provider
nb: API-nøkkel for AI-leverandøren

source: API key for the MT provider
nb: API-nøkkel for MT-leverandøren

source: Absolute Maximum Characters
nb: Absolutt maksimalt antall tegn

source: Absolute maximum character count for target text (0 = disabled)
nb: Absolutt maksimalt antall tegn for målteksten (0 = deaktivert)

source: Accept revisions automatically
nb: Godta revisjoner automatisk

source: Account email for higher rate limits (mymemory)
nb: Kontoens e-postadresse for høyere rategrenser (mymemory)

source: Add alt-trans elements
nb: Legg til alt-trans-elementer

source: Add line separator as character
nb: Legg til linjeskilletegn som tegn

source: Add tab as character
nb: Legg til tabulator som tegn

source: Add target elements for monolingual XLIFF files that have no target in the source
nb: Legg til target-elementer for enspråklige XLIFF-filer som mangler target i kilden

source: Add target-language attribute
nb: Legg til target-language-attributt

source: Add targets for monolingual XLIFF
nb: Legg til mål for enspråklig XLIFF

source: Add the target-language attribute to file elements if not already present
nb: Legg til target-language-attributtet på file-elementer hvis det ikke allerede finnes

source: Additional Comment Markers
nb: Flere kommentarmarkører

source: Advanced attribute-specific processing rules with element scope constraints
nb: Avanserte attributtspesifikke behandlingsregler med begrensninger på elementomfang

source: Advanced element-specific processing rules with conditions, inline marking, and translatable attribute mappings
nb: Avanserte elementspesifikke behandlingsregler med betingelser, inline-merking og tilordning av oversettbare attributter

source: Aggressive code cleanup
nb: Aggressiv kodeopprydding

source: Allow Empty Target Output
nb: Tillat tomme mål i utdata

source: Allow Source Mutation
nb: Tillat endring av kilden

source: Allow addition of new alt-trans elements
nb: Tillat at nye alt-trans-elementer legges til

source: Allow editing of existing alt-trans elements
nb: Tillat redigering av eksisterende alt-trans-elementer

source: Allow empty target in output when no translation is available
nb: Tillat tomt mål i utdata når ingen oversettelse er tilgjengelig

source: Allow empty targets
nb: Tillat tomme mål

source: Allow target elements with empty content to be written
nb: Tillat at target-elementer med tomt innhold skrives

source: Android String Resources
nb: Android-strengressurser

source: Apply to Source
nb: Bruk på kilde

source: Apply to Target
nb: Bruk på mål

source: Apply to source text
nb: Bruk på kildeteksten

source: Apply to target text
nb: Bruk på målteksten

source: Array of {pattern, format} mappings for embedded content in specific keys.
nb: Array av {pattern, format}-tilordninger for innebygd innhold i bestemte nøkler.

source: Array of {pattern, format} mappings for embedded content. Patterns use dot-separated element paths with glob support.
nb: Array av {pattern, format}-tilordninger for innebygd innhold. Mønstrene bruker punktumseparerte elementstier med glob-støtte.

source: Attribute Rules
nb: Attributtregler

source: Attribute names that are translatable across all elements
nb: Attributtnavn som er oversettbare i alle elementer

source: Attribute names used to extract block IDs from elements
nb: Attributtnavn som brukes til å hente blokk-ID-er fra elementer

source: Attribute rules
nb: Attributtregler

source: Auto (preserve input, default 2.2)
nb: Auto (bevar inndata, standard 2.2)

source: Automatically accept tracked changes before extraction. When true (default, matching Okapi), inserted runs are kept and deleted runs are dropped; rows marked with <w:trPr><w:del/> (ECMA-376 §17.13.5.13) are removed entirely; rows marked with <w:trPr><w:ins/> (§17.13.5.16) are kept.
nb: Godta sporede endringer automatisk før uttrekk. Når true (standard, som i Okapi), beholdes innsatte runs og slettede runs forkastes; rader merket med <w:trPr><w:del/> (ECMA-376 §17.13.5.13) fjernes helt; rader merket med <w:trPr><w:ins/> (§17.13.5.16) beholdes.

source: Azure subscription key (microsoft)
nb: Azure-abonnementsnøkkel (microsoft)

source: Batch Concurrency
nb: Batchsamtidighet

source: Batch Size
nb: Batchstørrelse

source: Bilingual Mode
nb: Tospråklig modus

source: Block type map
nb: Blokktypetilordning

source: Boundary Threshold
nb: Grenseterskel

source: Boundary probability threshold for the sat engine (0 = model default)
nb: Sannsynlighetsterskel for grenser i sat-motoren (0 = modellens standard)

source: Brand voice profile to resolve from the store
nb: Merkevarestemmeprofil som skal hentes fra lageret

source: Build TextUnit IDs from nested key stack.
nb: Bygg TextUnit-ID-er fra den nestede nøkkelstakken.

source: Case Sensitive
nb: Versalfølsom

source: Case Transform
nb: Endre store/små bokstaver

source: Case transformation mode
nb: Modus for store/små bokstaver

source: Character
nb: Tegn

source: Character Count
nb: Tegntelling

source: Character Set Encoding
nb: Tegnsettkoding

source: Character count above which text is considered long for the maximum length check
nb: Antall tegn som teksten må overstige for å regnes som lang i kontrollen av maksimal lengde

source: Character count above which text is considered long for the minimum length check
nb: Antall tegn som teksten må overstige for å regnes som lang i kontrollen av minimal lengde

source: Character count threshold between short and long text for max check
nb: Terskel i antall tegn mellom kort og lang tekst for makskontrollen

source: Character count threshold between short and long text for min check
nb: Terskel i antall tegn mellom kort og lang tekst for minkontrollen

source: Character used to quote field values containing delimiters or newlines
nb: Tegn som brukes til å omslutte feltverdier som inneholder skilletegn eller linjeskift

source: Characters
nb: Tegn

source: Characters Check
nb: Tegnkontroll

source: Characters Listing
nb: Tegnliste

source: Characters appended after each translated block
nb: Tegn som legges til etter hver oversatt blokk

source: Characters prepended before each translated block
nb: Tegn som settes inn foran hver oversatt blokk

source: Characters that must appear in target if present in source (e.g. punctuation)
nb: Tegn som må forekomme i målet hvis de finnes i kilden (f.eks. tegnsetting)

source: Characters that should not appear in target text (e.g. {}[])
nb: Tegn som ikke skal forekomme i målteksten (f.eks. {}[])

source: Check Absolute Maximum Length
nb: Kontroller absolutt maksimal lengde

source: Check Against Charset Encoding
nb: Kontroller mot tegnsettkoding

source: Check Code Differences
nb: Kontroller kodeforskjeller

source: Check Corrupted Characters
nb: Kontroller ødelagte tegn

source: Check Double Spaces
nb: Kontroller doble mellomrom

source: Check Leading Whitespace
nb: Kontroller innledende blanktegn

source: Check Maximum Length Ratio
nb: Kontroller maksimalt lengdeforhold

source: Check Minimum Length Ratio
nb: Kontroller minimalt lengdeforhold

source: Check Patterns
nb: Kontroller mønstre

source: Check Source Inconsistency
nb: Kontroller kildeinkonsistens

source: Check Span Constraints
nb: Kontroller span-begrensninger

source: Check Target Inconsistency
nb: Kontroller målinkonsistens

source: Check Trailing Whitespace
nb: Kontroller avsluttende blanktegn

source: Check for common corruption patterns such as mojibake
nb: Se etter vanlige korrupsjonsmønstre som mojibake

source: Check for consecutive repeated words in target text
nb: Se etter påfølgende gjentatte ord i målteksten

source: Check for double spaces in target text
nb: Se etter doble mellomrom i målteksten

source: Check for empty target when source has content
nb: Kontroller for tomt mål når kilden har innhold

source: Check for leading whitespace mismatches between source and target
nb: Kontroller for avvik i innledende blanktegn mellom kilde og mål

source: Check for non-empty target when source is empty
nb: Kontroller for ikke-tomt mål når kilden er tom

source: Check for patterns indicating encoding corruption (e.g. UTF-8 opened as ISO-8859-1)
nb: Se etter mønstre som tyder på ødelagt tegnkoding (f.eks. UTF-8 åpnet som ISO-8859-1)

source: Check for trailing whitespace mismatches between source and target
nb: Kontroller for avvik i avsluttende blanktegn mellom kilde og mål

source: Check non-deletable and non-cloneable span constraint violations
nb: Kontroller brudd på begrensninger for spans som ikke kan slettes eller klones

source: Check text against a brand voice profile using an LLM provider
nb: Kontroller tekst mot en merkevarestemmeprofil med en LLM-leverandør

source: Check translation quality using an LLM provider
nb: Kontroller oversettelseskvalitet med en LLM-leverandør

source: Check when target text is identical to source text
nb: Kontroller når målteksten er identisk med kildeteksten

source: Chunking Instruction
nb: Instruksjon for oppdeling

source: Code Finder Rules
nb: Kodefinnerregler

source: Code finder rules
nb: Kodefinnerregler

source: Column Names Row
nb: Rad med kolonnenavn

source: Column indices (0-based) that contain comments or notes
nb: Kolonneindekser (0-basert) som inneholder kommentarer eller merknader

source: Column indices (0-based) that provide the block ID (source ID / record ID)
nb: Kolonneindekser (0-basert) som gir blokk-ID-en (kilde-ID / post-ID)

source: Column indices (0-based) to extract as translatable content. If empty, all columns are translatable.
nb: Kolonneindekser (0-basert) som trekkes ut som oversettbart innhold. Hvis tom er alle kolonner oversettbare.

source: Column letters to exclude (e.g., "A", "C", "AA").
nb: Kolonnebokstaver som skal ekskluderes (f.eks. "A", "C", "AA").

source: Comment Columns
nb: Kommentarkolonner

source: Comments as Notes
nb: Kommentarer som merknader

source: Complex field definitions to extract
nb: Komplekse feltdefinisjoner som skal trekkes ut

source: Controls how inline codes are represented: original codes or generic markers or plain text
nb: Styrer hvordan inline-koder vises: originale koder, generiske markører eller ren tekst

source: Copy the best translation candidate into the target content
nb: Kopier den beste oversettelseskandidaten inn i målinnholdet

source: Count Inline Codes
nb: Tell inline-koder

source: Count Source
nb: Tell kilde

source: Count Target
nb: Tell mål

source: Count characters in source text
nb: Tell tegn i kildeteksten

source: Count characters in target text
nb: Tell tegn i målteksten

source: Count words in source text
nb: Tell ord i kildeteksten

source: Count words in target text
nb: Tell ord i målteksten

source: Create a TMX file with all leveraged matches
nb: Opprett en TMX-fil med alle gjenbrukte treff

source: Credential
nb: Legitimasjon

source: DeepL Translate
nb: DeepL-oversettelse

source: Demo (illustrative)
nb: Demo (illustrerende)

source: Detect i18next interpolation ({{var}}, {{var, format}}) and nesting ($t(key)) and protect them as inline codes so they are never translated.
nb: Oppdag i18next-interpolasjon ({{var}}, {{var, format}}) og nesting ($t(key)) og beskytt dem som inline-koder slik at de aldri oversettes.

source: Detect named entities (people, organizations, products, locations) using an LLM
nb: Oppdag navngitte entiteter (personer, organisasjoner, produkter, steder) med en LLM

source: Detection backends to run: rules and/or entities
nb: Deteksjonsmotorer som skal kjøres: rules og/eller entities

source: Detectors
nb: Detektorer

source: Diff Leverage
nb: Diff-gjenbruk

source: Discard invalid targets
nb: Forkast ugyldige mål

source: Discard targets that fail validation rather than rejecting the entire file
nb: Forkast mål som ikke består validering, i stedet for å avvise hele filen

source: Document 1 Label
nb: Etikett for dokument 1

source: Document 2 Label
nb: Etikett for dokument 2

source: Domain
nb: Domene

source: Dot Also Matches Line-Feed
nb: Punktum matcher også linjeskift

source: Doubled Word Exceptions
nb: Unntak for gjentatte ord

source: Downgrade Identical Exact Matches
nb: Nedgrader identiske eksakttreff

source: Doxygen Comments
nb: Doxygen-kommentarer

source: EPUB E-Book
nb: EPUB-e-bok

source: Edit alt-trans elements
nb: Rediger alt-trans-elementer

source: Element Rules
nb: Elementregler

source: Element extraction rules -- maps element names to their rule configuration (ruleTypes, conditions, idAttributes, translatableAttributes)
nb: Uttrekksregler for elementer -- tilordner elementnavn til regelkonfigurasjonen deres (ruleTypes, conditions, idAttributes, translatableAttributes)

source: Element names that preserve whitespace regardless of the global setting
nb: Elementnavn som bevarer blanktegn uavhengig av den globale innstillingen

source: Element names that produce group/layer boundaries in the output
nb: Elementnavn som gir gruppe-/laggrenser i utdataene

source: Element names treated as inline (spans within text) rather than block-level
nb: Elementnavn som behandles som inline (spenn i teksten) i stedet for som blokknivå

source: Element names whose content is excluded from extraction
nb: Elementnavn med innhold som ekskluderes fra uttrekket

source: Element names whose text content is translatable. If empty, all text content is translatable.
nb: Elementnavn med oversettbart tekstinnhold. Hvis tom er alt tekstinnhold oversettbart.

source: Element rules
nb: Elementregler

source: Email
nb: E-post

source: Emit entries whose extractionState is "stale" (the source string no longer appears in the code base) as translatable blocks.
nb: Send ut oppføringer med extractionState "stale" (kildestrengen finnes ikke lenger i kodebasen) som oversettbare blokker.

source: Emit font metadata as annotations on blocks.
nb: Legg ved skriftmetadata som annotasjoner på blokker.

source: Enable Inline Code Detection
nb: Aktiver deteksjon av inline-koder

source: Enable Key Condition
nb: Aktiver nøkkelbetingelse

source: Enable fuzzy matching for similar texts
nb: Aktiver fuzzy-matching for lignende tekster

source: Enable inline code detection
nb: Aktiver deteksjon av inline-koder

source: Enable pattern-based detection of inline codes (placeholders, tags, etc.).
nb: Aktiver mønsterbasert deteksjon av inline-koder (plassholdere, tagger osv.).

source: Enable regex-based detection of inline codes (placeholders, variables, tags) within translatable text
nb: Aktiver regex-basert deteksjon av inline-koder (plassholdere, variabler, tagger) i oversettbar tekst

source: Enable regex-based detection of inline codes within translatable text
nb: Aktiver regex-basert deteksjon av inline-koder i oversettbar tekst

source: Enable regex-based inline code detection in translatable text
nb: Aktiver regex-basert deteksjon av inline-koder i oversettbar tekst

source: Enable regex-based inline code detection within PO message text
nb: Aktiver regex-basert deteksjon av inline-koder i PO-meldingstekst

source: Enable regex-based inline code detection within cell values
nb: Aktiver regex-basert deteksjon av inline-koder i celleverdier

source: Enable regex-based inline code detection within property values
nb: Aktiver regex-basert deteksjon av inline-koder i property-verdier

source: Enable regex-based inline code detection within string values
nb: Aktiver regex-basert deteksjon av inline-koder i strengverdier

source: Enable regex-based inline code detection within translatable text
nb: Aktiver regex-basert deteksjon av inline-koder i oversettbar tekst

source: Enable regex-based inline code detection within translatable text.
nb: Aktiver regex-basert deteksjon av inline-koder i oversettbar tekst.

source: Enable regular expression mode for all search patterns
nb: Aktiver modus for regulære uttrykk for alle søkemønstre

source: Enable terminology checks
nb: Aktiver terminologikontroller

source: Encoding Detect
nb: Tegnkodingsdeteksjon

source: Enforce Strict Code Order
nb: Håndhev streng koderekkefølge

source: Enforce unique trans-unit IDs
nb: Håndhev unike trans-unit-ID-er

source: Ensure inline tag IDs are unique within each unit
nb: Sørg for at inline-tagg-ID-er er unike i hver enhet

source: Ensure unique tag IDs
nb: Sikre unike tagg-ID-er

source: Entity Categories
nb: Entitetskategorier

source: Entity categories to redact: person
nb: Entitetskategorier som skal sladdes: person

source: Escape > as &gt; in output XML
nb: Escape > som &gt; i XML-utdata

source: Escape Extended Characters
nb: Escape utvidede tegn

source: Escape extended Unicode characters (non-ASCII) in output using \uXXXX notation
nb: Escape utvidede Unicode-tegn (ikke-ASCII) i utdata med \uXXXX-notasjon

source: Escape forward slashes
nb: Escape skråstreker

source: Escape forward slashes in output JSON (\/).
nb: Escape skråstreker i JSON-utdata (\/).

source: Escape greater-than characters
nb: Escape større enn-tegn

source: Escape line breaks
nb: Escape linjeskift

source: Exclude <string> values that are a bare resource reference (e.g. @string/foo, ?attr/bar). A reference is an alias, not translatable UI text.
nb: Ekskluder <string>-verdier som bare er en ressursreferanse (f.eks. @string/foo, ?attr/bar). En referanse er et alias, ikke oversettbar UI-tekst.

source: Exclude <string>/<string-array>/<plurals> entries marked translatable="false" from extraction. Such resources are developer-owned and round-trip verbatim.
nb: Ekskluder <string>-/<string-array>-/<plurals>-oppføringer merket med translatable="false" fra uttrekket. Slike ressurser eies av utvikleren og bevares uendret ved rundtur.

source: Exclude all elements unless explicitly included by an element rule with INCLUDE
nb: Ekskluder alle elementer med mindre de eksplisitt inkluderes av en elementregel med INCLUDE

source: Exclude by default
nb: Ekskluder som standard

source: Exclude designer name-reference entries (those whose name starts with ">", e.g. ">>control.Name") from extraction. These carry WinForms field names, not UI strings.
nb: Ekskluder designer-navnereferanser (oppføringer med navn som begynner med ">", f.eks. ">>control.Name") fra uttrekket. Disse inneholder WinForms-feltnavn, ikke UI-strenger.

source: Exclude highlight colors
nb: Ekskluder uthevingsfarger

source: Exclude leading whitespace from each segment span
nb: Utelat innledende blanktegn fra hvert segmentspenn

source: Exclude specific font colors
nb: Ekskluder bestemte skriftfarger

source: Exclude styles
nb: Ekskluder stiler

source: Exclude trailing whitespace from each segment span
nb: Utelat avsluttende blanktegn fra hvert segmentspenn

source: Excluded columns
nb: Ekskluderte kolonner

source: Excluded elements
nb: Ekskluderte elementer

source: Excluded sheets
nb: Ekskluderte ark

source: Exec (subprocess extractor)
nb: Exec (uttrekk i underprosess)

source: Exit on invalid TUs
nb: Avbryt ved ugyldige TU-er

source: Expansion Percent
nb: Ekspansjonsprosent

source: Extra padding percentage added to simulate translation expansion (0 = no padding)
nb: Ekstra utfyllingsprosent som legges til for å simulere ekspansjon ved oversettelse (0 = ingen utfylling)

source: Extract $description documentation
nb: Trekk ut $description-dokumentasjon

source: Extract $description values (human-readable token and group documentation) as translatable blocks. This is the only natural-language field in DTCG; $value is always a typed design value (colour, dimension, font name, …) and is never extracted. Disable to read the file as fully non-translatable structure.
nb: Trekk ut $description-verdier (lesbar dokumentasjon for tokener og grupper) som oversettbare blokker. Dette er det eneste naturspråklige feltet i DTCG; $value er alltid en typet designverdi (farge, dimensjon, skriftnavn, …) og trekkes aldri ut. Deaktiver for å lese filen som fullstendig ikke-oversettbar struktur.

source: Extract Non-String Values
nb: Trekk ut ikke-strengverdier

source: Extract Only Matching Keys
nb: Trekk bare ut matchende nøkler

source: Extract all key-value pairs for translation. When false, use extractionRules to specify which paths to extract.
nb: Trekk ut alle nøkkel/verdi-par for oversettelse. Når false, bruk extractionRules til å angi hvilke stier som skal trekkes ut.

source: Extract all key/string pairs
nb: Trekk ut alle nøkkel/streng-par

source: Extract candidate terminology from content using an LLM provider
nb: Trekk ut terminologikandidater fra innhold med en LLM-leverandør

source: Extract comment text from Word documents.
nb: Trekk ut kommentartekst fra Word-dokumenter.

source: Extract comments as notes
nb: Trekk ut kommentarer som merknader

source: Extract content from hidden slides in PowerPoint.
nb: Trekk ut innhold fra skjulte lysbilder i PowerPoint.

source: Extract external hyperlinks
nb: Trekk ut eksterne hyperkoblinger

source: Extract footnotes and endnotes from Word documents.
nb: Trekk ut fotnoter og sluttnoter fra Word-dokumenter.

source: Extract hyperlink text for translation.
nb: Trekk ut hyperkoblingstekst for oversettelse.

source: Extract non-string scalar values (booleans, numbers, nulls) as translatable blocks
nb: Trekk ut skalarverdier som ikke er strenger (boolske verdier, tall, null), som oversettbare blokker

source: Extract outside the scope of the directives
nb: Trekk ut utenfor direktivenes virkeområde

source: Extract run fonts info
nb: Trekk ut skriftinformasjon for runs

source: Extract shared strings from Excel workbooks.
nb: Trekk ut delte strenger fra Excel-arbeidsbøker.

source: Extract sheet names in Excel workbooks.
nb: Trekk ut arknavn i Excel-arbeidsbøker.

source: Extract speaker notes in PowerPoint presentations.
nb: Trekk ut foredragsholdernotater i PowerPoint-presentasjoner.

source: Extract stale entries
nb: Trekk ut foreldede oppføringer

source: Extract string values in arrays (without keys) as translatable blocks.
nb: Trekk ut strengverdier i arrays (uten nøkler) som oversettbare blokker.

source: Extract strings from embedded charts.
nb: Trekk ut strenger fra innebygde diagrammer.

source: Extract strings without associated key
nb: Trekk ut strenger uten tilknyttet nøkkel

source: Extract text from SmartArt diagrams.
nb: Trekk ut tekst fra SmartArt-grafikk.

source: Extract text from headers and footers in Word documents.
nb: Trekk ut tekst fra topptekster og bunntekster i Word-dokumenter.

source: Extract text from slide masters in PowerPoint.
nb: Trekk ut tekst fra lysbildemaler i PowerPoint.

source: Extract text with the vanish (hidden) property in Word documents.
nb: Trekk ut tekst med vanish-egenskapen (skjult) i Word-dokumenter.

source: Extract title, subject, keywords from document properties.
nb: Trekk ut tittel, emne og nøkkelord fra dokumentegenskapene.

source: Extract translatable strings found outside directive-controlled regions.
nb: Trekk ut oversettbare strenger som finnes utenfor direktivstyrte områder.

source: Extraction Engine
nb: Uttrekksmotor

source: Extraction rules
nb: Uttrekksregler
